app/controllers/movies_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 3]]
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

INSERT INTO "movies" ("title", "description", "movie_length", "year", "IMDB_rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_updated_at", "2016-04-04 01:29:01.916847"], ["image_file_name", "hero.jpg"], ["updated_at", "2016-04-04 01:29:02.184862"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)