app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 7], ["comment", "Zoootopia was a nice movie"], ["user_id", 1], ["movie_id", 2], ["created_at", "2016-04-04 05:15:18.677393"], ["updated_at", "2016-04-04 05:15:18.677393"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id= @movie.id
    respond_to do |format|
      if @review.save